In [1]:
import pandas as pd

In [5]:
nba = pd.read_csv("nba.csv").dropna(how = 'all')

In [8]:
nba['Salary'].fillna(0, inplace = True)
nba['College'].fillna('None', inplace = True)

In [9]:
nba.head(6)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,0.0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,None,5000000.0
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,None,12000000.0

In [10]:
nba.dtypes

Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

In [27]:
nba.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 457 entries, 0 to 456
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    category
 2   Number    457 non-null    int32
 3   Position  457 non-null    category
 4   Age       457 non-null    int32
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   457 non-null    object
 8   Salary    457 non-null    int32
 9   number    457 non-null    int32
dtypes: category(2), float64(1), int32(4), object(3)
memory usage: 27.4+ KB

In [13]:
nba['Salary'] = nba['Salary'].astype('int')

In [14]:
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,0

In [18]:
nba['Number'] = nba['Number'].astype('int')

In [19]:
nba['Age'] = nba['Age'].astype('int')

In [20]:
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,number
0,Avery Bradley,Boston Celtics,0,PG,25,6-2,180.0,Texas,7730337,0
1,Jae Crowder,Boston Celtics,99,SF,25,6-6,235.0,Marquette,6796117,99
2,John Holland,Boston Celtics,30,SG,27,6-5,205.0,Boston University,0,30

In [21]:
nba['Position'].nunique()

5

In [22]:
nba['Position'] = nba['Position'].astype('category')

In [24]:
nba['Team'].nunique()

30

In [25]:
nba['Team'] = nba['Team'].astype('category')

In [26]:
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,number
0,Avery Bradley,Boston Celtics,0,PG,25,6-2,180.0,Texas,7730337,0
1,Jae Crowder,Boston Celtics,99,SF,25,6-6,235.0,Marquette,6796117,99
2,John Holland,Boston Celtics,30,SG,27,6-5,205.0,Boston University,0,30
3,R.J. Hunter,Boston Celtics,28,SG,22,6-5,185.0,Georgia State,1148640,28
4,Jonas Jerebko,Boston Celtics,8,PF,29,6-10,231.0,None,5000000,8